詳細設計/React-Rails実装テスト_参考/サンプルソース/Rails_api_sample/app/controllers/products_controller.rb

  def index
    @product = Product.all
---
SELECT `products`.* FROM `products`

  def create
    @product = Product.create(product: params[:product])
---
INSERT INTO `products` (`product`, `created_at`, `updated_at`) VALUES ('fa', '2020-02-16 02:28:29.463574', '2020-02-16 02:28:29.463574')

  def update
    @product = Product.find(params[:id])
    @product.update_attributes(product: params[:product])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 6 LIMIT 1
UPDATE `products` SET `products`.`product` = 'hhhh', `products`.`updated_at` = '2020-02-16 02:33:40.234209' WHERE `products`.`id` = 6

  def destroy
    @product = Product.find(params[:id])
    if @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 1